import { Component, OnInit } from '@angular/core';
import { Navigations } from 'src/app/shared/utils/navigations';

@Component({
  selector: 'app-landing',
  templateUrl: './landing.component.html',
  styleUrls: ['./landing.component.scss'],
})
export class LandingComponent {
  navOptions: any = Navigations.landingNav;

  objectives: any = [
    'مدارس اسلامیہ کو جدید طرز پر خدمت دین کے لئے رہنمائی فراہم کرنا',
    'مدارس اسلامیہ میں مدرسین علوم دینیہ کی کمی کو پورا کرنے کے لئے ایسے اقدامات کرنا جس سے نئے مدرسین علوم دینیہ کی ایک بڑی کھیپ تیار ہو اور اہلسنت کی نظریاتی حدود کا تحفظ ممکن ہو',
    'مدارس و جامعات کی احیاء حریتِ فکر کا تحفظ کرنا',
    'وفاق سے ملحقہ مدارس و جامعات کے لئے یکساں نصاب تعلیم کا تعین کرنا',
  ];

  backgroundAndHistory: any = [
    'وفاق المدارس الاسلامیہ الرضویہ پاکستان (المسجلۃ) اللہ تعالیٰ نے دین کی تبلیغ کے لئے روز اوّل سے تعلیم و تربیت کا سلسلہ جاری فرمایا اور اس کے لئے انبیاء و رسل کو مبعوث فرمایا اور آسمانی کتب و صحائف کو نازل فرمایا۔ سلسلہ نبوت کی خشت اول سیدنا حضرت آدمdہیں اور یہ سلسلہ امام المرسلین خاتم النبین حضرت محمد مصطفی aکی ذات بابرکات پر مکمل ہوا۔ آپ aکے ظاہری پردہ فرمانے کے بعد یہ ذمہ داری صحابہ کرامhنے سرانجام دی اور صحابہ کرام jکی تعلیم و تربیت کے لئے آقا کریمaنے خود مسجد نبوی میں پہلا مدرسہ صفہ کے نام سے قائم فرمایا جس میں اقامتی و غیراقامتی تشنگان علم کے لئے نظام موجود تھا۔ اسی مدرسہ صفہ کی روشن تاریخ کی مثالیں جامعہ نظامیہ (بغداد شریف)، جامعہ زیتونہ(مراکش)، جامعہ رضویہ منظر اسلام(بریلی شریف) اور جامعہ رضویہ مظہر اسلام(فیصل آباد) ہیں۔ مدرسہ صفہ کی روایت کو آگے بڑھاتے ہوئے عصرِ حاضر میں قدیم و جدید علوم کی ترویج و اشاعت کے لئے وفاق المدارس الاسلامیہ الرضویہ الباکستان کا قیام ۲۸جمادی الثانی ۱۴۴۲ہجری بمطابق۰ ۱ فروری۱ ۲۰۲ء کو عمل میں لایا گیا۔',
  ];

  mainNotification: string =
    'سالانہ امتحانات 2023 ء میں شرکت کے خواہشمند اُمیدوار حسبِ شیڈول داخلہ جمع کروا سکتے ہیں وفاق المدارس الاسلامیہ الرضویہ پاکستان  کے تحت  داخلہ بھیجنے والے طلبہ و طالبات کیلئے نظام الاوقات ایک ہی ہیں۔';

  notifications: any = [
    'امتحانی شیڈول سالانہ امتحانات 2023ء برائے طلبہ و طالبات',
    'وفاق المدارس اسلامیہ الرضویہ پاکستان کا فیس بک پیج',
    'بعض مدارس کے منتظمین رول نمبر سلپس وصول ہونے کے ساتھ ہی امیدواروں میں تقسیم کرنے کی بجائے امتحان شروع ہونے پر (آخری دن) تقسیم کرتے ہیں ۔ کیونکہ طلبہ و طالبات اپنی رول نمبر سلپ سنبھال کر نہیں رکھتے ، لہٰذا حفاظتی نقطہ نگاہ سے ایسا کیا جاتا ہے ۔ مشورہ دیا جاتا ہے کہ رول نمبر سلپ وصول ہوتے ہی امیدوار کو جاری کی جائے اور اسے اس کے مندرجات پڑھنے ، چیک کرنےاور ہدایات کو سمجھنے کے ساتھ ساتھ سنبھال کر رکھنے کی تاکید وہدایت کی جائے ۔ البتہ حفظ ماتقدم کے طور پر اس کی فوٹو کاپی کر کے امیدوار کے پاس بھی الگ سے محفوظ رکھنے کا کہا جائے اور دفتری ریکارڈ کے لئے بھی فوٹو کاپی کروا کر محفوظ کر لی جائے تاکہ بوقت ضرورت کام میں لائی جا سکے ۔ شعبہ تعلقات عامہ وفاق المدارس الاسلامیہ الرضویہ پاکستان',
  ];
  quickLinks: any = [
    'Lorem ipsum dolor sit amet consectetur adipisicing.',
    'Lorem ipsum dolor sit amet consectetur adipisicing.',
    'Lorem ipsum dolor sit amet consectetur adipisicing.',
    'Lorem ipsum dolor sit amet consectetur adipisicing.',
    'Lorem ipsum dolor sit amet consectetur adipisicing.',
    'Lorem ipsum dolor sit amet consectetur adipisicing.',
  ];
  constructor() {}
}
