import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-objective',
  templateUrl: './objective.component.html',
  styleUrls: ['./objective.component.scss'],
})
export class ObjectiveComponent {
  objectives: any = [
    'مدارس اسلامیہ کو جدید طرز پر خدمت دین کے لئے رہنمائی فراہم کرنا',
    'مدارس اسلامیہ میں مدرسین علوم دینیہ کی کمی کو پورا کرنے کے لئے ایسے اقدامات کرنا جس سے نئے مدرسین علوم دینیہ کی ایک بڑی کھیپ تیار ہو اور اہلسنت کی نظریاتی حدود کا تحفظ ممکن ہو',
    'مدارس و جامعات کی احیاء حریتِ فکر کا تحفظ کرنا',
    'وفاق سے ملحقہ مدارس و جامعات کے لئے یکساں نصاب تعلیم کا تعین کرنا',
    'مدارس اسلامیہ کو عصرِ حاضر کے تقاضوں کے مطابق اپڈیٹ کرنا',
    'عالمی سطح پر مدارس اسلامیہ کے خلاف سازشوں کا تدارک کرنا اور اس کے لئے منصوبہ سازی کرنا',
    'ملک بھر میں زبوں حالی کا شکار مدارس اہل سنت بالخصوص بلوچستان، آزاد کشمیر، کے پی کے، اندرون سندھ اور جنوبی پنجاب میں مدارس اہل سنت کو اپ گریڈ کرنا',
    'گلگت،  بلتستان میں باقاعدہ طورپر مدارس اہل سنت قائم کرنا',
    'اسلام میں عورتوں کو دیئے گئے حقوق کو مد نظر رکھتے ہوئے ملک بھر میں مدارس اہل سنت (طالبات) میں کمپیوٹر کورسز، ٹیکنیکل کورسز، امور خانہ داری و دیگر مفید کورسز پر خصوصی توجہ دینا اور اس کے لئے ہنگامی اقدامات کرنا',
    'وفاق سے ملحقہ مدارس کو طے کردہ ضابطہ کے مطابق مالی معاونت فراہم کرنا',
    'وفاق سے ملحقہ مدارس سے فارغ التحصیل علماء و فضلاء کے لئے سرکاری و نجی اداروں میں ملازمت کے حصول کے لئے سعی کرنا',
    'وفاق سے ملحقہ مدارس سے فارغ التحصیل طلباء و طالبات کے لئے اعلیٰ تعلیم(ایم فل و پی ایچ ڈی) کے لئے اسکالر شپ کا اجراء کرنا اور بیرون ممالک حصول تعلیم کے لئے سعی کرنا',
    'وفاق سے ملحقہ مدارس کے اساتذہ کرام کے وقار کو ملحوظ خاطر رکھتے ہوئے قابل قدر وظیفہ کے لئے عملی اقدامات کرنا',
    'قومی و بین الاقوامی جامعات میں مدارس اہل سنت کے طلباء و طالبات کے لئے اعلیٰ تعلیم کے مواقع فراہم کرنے کی کوشش کرنا',
    'دنیا میں بڑھتے ہوئے اسلامو فوبیاکے خلاف مؤثرحکمت ِ عملی ترتیب دینا',
    'وفاق خالصتاً ایک تعلیمی و تحقیقی ادارہ ہو گا جو کہ مکمل طور پر غیر سیاسی ہو گا',
    'جدید تعلیمی اداروں اور مدارس اسلامیہ کے مابین بڑھتے ہوئے فاصلوں کو کم کرنے کے لئے عملی اقدامات کرنا',
    'واق سے ملحقہ مدارس میں بین المدارس مقابلہ جات برائے تلاوت، نعت شریف، تقریر، سپورٹس کے لئے اقدامات کرنا',
    'وفاق سے ملحقہ خواتین کے مدارس کے جملہ انتظام و انصرام کی بابت شعبہ خواتین قائم کرنا',
    'وفاق سے ملحقہ جملہ مدارس میں دہشتگردی کے تدارک، انتہا پسندی اور فرقہ واریت کے حوالے سے عملی اقدامات کرنا',
    'وفاق سے ملحقہ مدارس میں دو قومی نظریہ کی بقاء اور وطن عزیز کی نظریاتی اور جغرافیائی اساس سے وفاداری کا شعور پیدا کرنا',
    '۔ وفاقی وزارت تعلیم و پیشہ ورانہ تربیت اور ہائیر ایجوکیشن کمیشن (HEC)کی مشاورت سے مدارس کے لئے تعلیمی پالیسیاں بنانا۔',
  ];

  constructor() {}
}
